ccserver/app/controllers/hosts_controller.rb

  def index
    @hosts = Msf::DBManager::Host.all
---
SELECT * FROM `hosts`

  def show
    @host = Msf::DBManager::Host.find params[:id]
---
SELECT * FROM `hosts` WHERE (`hosts`.`id` = 2)